// Importing Part
import DashboardPageComponent from "@/component/dashboard/dashboardPageComponent";
import Link from "next/link";
import FeaturesComponent from "@/component/dashboard/featuresComponent";

// Creating And Exporting Dashboard Page As Default
export default function DashboardPage() {
    // Returning JSX
    return (
        <DashboardPageComponent>
            <div>
                <FeaturesComponent icon={'bi-server'} title={'سرور ابری'} fgColor={'red'} bgColor={'blue'} subtitle={'ساخت و مدیریت سرور های ابری'} />
                <FeaturesComponent icon={'bi-cloud-download'} title={'توزیع ابری'} fgColor={'red'} bgColor={'blue'} subtitle={'امنیت ابری'} />
                <FeaturesComponent icon={'bi-cloud-download'} title={'امنیت ابری'} fgColor={'red'} bgColor={'blue'} subtitle={'برقراری امنیت کامل خدمات ابری'} />
                <FeaturesComponent icon={'bi-globe'} title={'DNS ابری'} fgColor={'red'} bgColor={'blue'} subtitle={'مدیریت ایمن دامنه ها'} />
                <FeaturesComponent icon={'bi-cart'} title={'بازارچه ابری'} fgColor={'red'} bgColor={'blue'} subtitle={'شروعی سریع برای کسب و کارها'} />
            </div>
            <div>
                <div>
                    <div>
                        <div><span className={'bi bi-envelope'} /></div>
                        <span>پیام ها</span>
                    </div>
                    <ul>
                        <li>
                            <Link href={'#'}>
                                <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.س</p>
                                <span>
                                    1
                                    ماه پیش
                                </span>
                            </Link>
                        </li>
                        <li>
                            <Link href={'#'}>
                                <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.س</p>
                                <span>
                                    1
                                    ماه پیش
                                </span>
                            </Link>
                        </li>
                        <li>
                            <Link href={'#'}>
                                <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.س</p>
                                <span>
                                    1
                                    ماه پیش
                                </span>
                            </Link>
                        </li>
                        <li>
                            <Link href={'#'}>
                                <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.س</p>
                                <span>
                                    1
                                    ماه پیش
                                </span>
                            </Link>
                        </li>
                    </ul>
                </div>
                <div>
                    <div>
                        <div><span className={'bi bi-calculator'} /></div>
                        <span>ماشین حساب</span>
                    </div>
                    <div>
                        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.س</p>
                        <Link href={'#'}>محاسبه هزینه ها</Link>
                    </div>
                </div>
            </div>
        </DashboardPageComponent>
    );
}